
<html dir="rtl">
	<head>
		<meta http-equiv="PICS-Label" content='(PICS-1.1 "http://www.rsac.org/ratingsv01.html" l gen true comment "RSACi North America Server" by "inet@microsoft.com" on "1997.06.30T14:48-0500" r (n 0 s 0 v 0 l 0))' />
		<meta http-equiv="Content-Type" content="text/html;charset=windows-1256" />
		<meta http-equiv="MSThemeCompatible" content="yes" />
		<meta name="MSSmartTagsPreventParsing" content="yes" />
		<script language="JScript" type="text/javascript">function window.onerror(sMessage, sURL, sLine){ return true; }</script><script language="JScript" type="text/javascript" src="/shared/js/content.js"></script><link rel="stylesheet" type="text/css" href="/shared/css/hcp.css" />
		<link rel="stylesheet" type="text/css" href="/shared/css/content.css" />
		<link rel="stylesheet" type="text/css" href="/shared/css/rtl.css" />
		<title>إطار المحتوى</title>
	</head>
	<body onload="fnInit(5, -1);">
		<span class="sys-font-heading3 sys-rhp-color-title">حول Windows Update</span><br />
		إن Windows Update هو الملحق الفوري لـ Windows والذي يساعدك على الحفاظ على بقاء جهازك في أحدث حالة. استخدم Windows Update لاختيار التحديثات لنظام التشغيل وبرامج الكمبيوتر والأجهزة الموجودة على جهازك. يتم إضافة محتوى جديد للموقع باستمرار وذلك لكي تتمكن من الحصول على أحدث التحديثات والإصلاحات لحماية جهازك واستمرارية عمله دون مشاكل.<br /><br />
		<ol>
			 <li>هل تبحث عن آخر التحديثات لجهازك؟ فعند النقر فوق Windows Update على القائمة 'ابدأ' أو على صفحة ويب الرئيسية لمركز التعليمات والدعم، يقوم Windows Update بتسهيل الأمور حيث لا يقدم سوى التحديثات التي تلائم احتياجات جهازك. <a href="#windowsupdate" class="sys-link-normal">قراءة المزيد حول Windows Update.</a></li>
			 <li>إذا كنت مسؤول شبكة اتصال (administrator) أو مستخدم متقدم (advanced) وتحتاج إلى تحميل تحديثات لأجهزة أخرى، قم بالاستفادة من نشرة Windows Update. انقر فوق نشرة Windows Update في إطار التنقل الأيمن (إن لم ترى هذا ألإطار، انقر فوق <b>تخصيص Windows Update</b> لرؤية الخيارات لعرض هذا الرابط). <a href="#windowscatalog" class="sys-link-normal">قراءة المزيد حول نشرة Windows Update.</a></li>
		</ol>
		<br />

		<a name="windowsupdate" class="aboutHeader">Windows Update</a><br />
		<ul type="square">
			<li>
				<b>كيف أعرف إذا كنت بحاجة إلى تحديث؟</b><br />
				يتفحص Windows Update جهازك ويوفر لك مجموعة تحديثات مخصصة تنطبق على العناصر الموجودة فقط على جهازك. أثناء التفحص، تظهر قائمة بالفئات أسفل "مرحباً بك في Windows Update" ويتم ذكر عدد التحديثات المتوفرة في كل فئة بين قوسين.<br /><br />
			</li>
			<li>
				<b>التحديثات الضرورية هامة!</b><br />
				يتم تصنيف أي تحديث ضروري لعمل جهازك على أنه  "تحديث ضروري" وتتم إضافته إلى سلة التحديثات الخاصة بك بشكل تلقائي أثناء التفحص من أجل التحديثات المتوفرة. يتم توفير هذه التحديثات للمساعدة على حل الأمور المعلومة ولحماية جهازك من الأعراض الأمنية المعلومة. في حال أن التحديث الضروري ينطبق على نظام التشغيل أو البرامج أو الأجهزة، يتم سرده في فئة &quot;التحديثات الضرورية&quot;.<br /><br />
			</li>
			<li>
				<b>كيف تعمل؟</b><br />
				اتبع العملية السهلة ذات الخطوات الثلاث للحصول على ماتحتاجه لإبقاء جهازك على أحدث حالة:<br />
				<ol>
					<li>عند الدخول إلى موقع Windows Update، انقر فوق <b>البحث عن تحديثات</b>.</li>
					<li>بينما تقوم باستعراض التحديثات المتوفرة من كل فئة، انقر فوق <b>إضافة</b> لتحديد التحديث الذي تختاره وإضافته إلى مجموعة التحديثات المُراد تثبيتها. يمكنك أيضاً قراءة وصف كامل لكل عنصر بالنقر فوق الرابط <b>قراءة المزيد</b>.</li>
					<li>عند تحديد كافة التحديثات التي تريدها، انقر فوق <b>مراجعة التحديثات وتثبيتها</b>، ثم انقر فوق <b>التثبيت الآن</b>.</li>
				</ol>
				<b><b>ملاحظة</b></b> تتطلب بعض التحديثات إعادة تشغيل الكمبيوتر. قم بحفظ كافة أعمالك وإغلاق البرامج المفتوحة قبل البدء بعملية التثبيت.<br /><br />
			</li>
			<li>
				<b>هل لديك أسئلة عن تحديثٍ ما؟</b><br />
				يرافق كل تحديث وصف وجيز ورابط <b>قراءة المزيد</b>. انقر فوق <b>قراءة المزيد</b> في أي وقت لرؤية المعلومات الخاصة بكل تحديث. تتضمن هذه المعلومات متطلبات النظام وتعليمات كيفية الاستخدام وإزالة التثبيت، إذا وجدت.<br /><br />
			</li>
			<li>لرؤية قائمة بالتحديثات التي قمت بتثبيتها من Windows Update، انقر فوق <b>عرض محفوظات التثبيت</b>.<br /><br /></li>
			<li>للحصول على تفاصيل حول دعم موقع Windows Update والدعم للتحديثات التي قمت بتثبيتها من Windows Update، الرجاء زيارة صفحة <a href="support.asp" class="sys-link-normal">معلومات عن الدعم</a>.<br /><br /></li>
		</ul>
		<br />

		<a name="privacypolicy" class="aboutHeader">بيان خصوصية Windows Update (تاريخ التحديث الأخير 17/10/2003)</a><br />
		يلتزم Windows Update بحماية خصوصياتك، ولكنه يحتاج إلى جمع قدر معين من معلومات التكوين من الكمبيوتر الخاص بك. ولا يمكن استخدام أي من معلومات التكوين هذه للتعرف عليك. وتتضمن هذه المعلومات ما يلي:<br />
		<ul type="square">
			<li>رقم إصدار نظام التشغيل</li>
			<li>رقم إصدار Internet Explorer</li>
			<li>أرقام إصدارات البرامج الأخرى التي يوفر Windows Update تحديثات لها</li>
			<li>أرقام تعريف توصيل وتشغيل الأجهزة</li>
			<li>إعداد المنطقة واللغة</li>
		</ul>
		وتُستخدم معلومات التكوين التي يتم جمعها فقط لتحديد التحديثات الملائمة وعمل إحصائيات إجمالية. ولا يجمع موقع Windows Update اسمك أو عنوانك أو عنوان بريدك الإلكتروني أو أي شكل آخر من معلومات تعريف الشخصية.<br /><br />
		يجمع موقع Windows Update أيضًا معرف المنتج ومفتاح المنتج للتأكد من استخدامك لنسخة Windows ذات ترخيص صالح. وتضمن نسخة Windows ذات الترخيص الصالح أنك ستتلقى التحديثات المستمرة من موقع Windows Update. ولا يتم الاحتفاظ بمعرف المنتج ومفتاح المنتج بعد نهاية جلسة عمل Windows Update، ما لم يكن معرف المنتج غير صالح.<br /><br />
		ولإمدادك بأفضل خدمة ممكنة، يقوم موقع Windows Update أيضًا بتتبع عدد الأجهزة الفريدة التي تزور موقعه وما إذا كان تحميل بعض التحديثات المحددة وتثبيتها قد تم بنجاح أم تعرض للفشل. وللقيام بذلك، يقوم نظام التشغيل Windows بإنشاء معرّف فريد عمومي (GUID) يتم تخزينه على الكمبيوتر الخاص بك لتعريفه بشكل فريد. ولا يحتوي المعرّف الفريد العمومي (GUID) على معلومات لتعريف الشخصية ولا يمكن استخدامه للتعرف عليك. حيث يسجل Windows Update المعرّف الفريد العمومي الخاص بالكمبيوتر الذي تمت محاولة التحميل منه ومعرّف العنصر الذي تمت محاولة تحميله وتثبيته ومعلومات التكوين المسرودة أعلاه.<br /><br /><br />
		<a class="aboutHeader" name="windowscatalog">نشرة Windows Update</a><br />
		توفر نشرة Windows Update المصورة سردًا شاملاً للتحديثات التي يمكن توزيعها عبر شبكات اتصال الشركات. وهي تعتبر مكانًا واحدًا للحصول على تحديثات Windows وتصحيحاته وتحسيناته بالإضافة إلى <a href="#driverupdates" class="sys-link-normal">برامج تشغيل الأجهزة</a> التي تحمل شعار <a href="http://go.microsoft.com/fwlink/?linkid=9577&clcid=0x401" target ="_blank" class="sys-link-normal">Designed for Windows</a>.<br /><br />
		للحصول على تحديثات من نشرة Windows Update، اتبع الخطوات الثلاث التالية:<br /><br />
		<ol>
			<li>ابدأ بتحديد فئة:
				<ul type="disc">
					<li>تحتوي فئة <a href="#windowsupdates" class="sys-link-normal">Microsoft Windows</a> على تحديثات وإصلاحات لكافة أنظمة تشغيل Windows بدءًا من Windows 98 حتى Windows XP ومجموعة أنظمة تشغيل Windows Server 2003.</li>
					<li>توفر فئة <a href="#driverupdates" class="sys-link-normal"> لبرامج تشغيل الأجهزة</a> تحديثات برامج التشغيل للعديد من الأجهزة الموجودة على شبكة الاتصال لديك.</li>
				</ul>
			</li>
			<li>قم بإعداد معايير البحث للعثور على التحديثات التي تحتاج إليها.</li>
			<li>قم بتحميل التحديثات التي حددتها إلى الموقع الذي تختاره؛ قد يكون هذا الموقع هو القرص الثابت المحلي أو مشاركة على ملقم على شبكة الاتصال لديك أو قرص آخر.</li>
		</ol>

		تتضمن ميزات الموقع الإضافية:<br /><br />
		<ul type="disc">
			<li>حزم التحديثات مسبقاً في بنية دليل فرعي حسب: نوع التحديث (برامج كمبيوتر أم برامج تشغيل) والموقع واسم المكون.<br/>(مثلاً, ‎\Software\[Locale]\[Platform]\[ComponentName]‎)</li>
			<li>يقوم عرض محفوظات التحميل بإظهار التحديثات التي تم تحميلها وموقع وجودها.</li>
			<li>وصف بسيط و &quot;قراءة المزيد...&quot; من الملفات لكل عنصر. تظهر الروابط لمواقع ويب المناسبة في هذه الملفات ويتم تحميلها إلى الدليل الفرعي الذي يحتوي على تحديث برامج الكمبيوتر، لذلك تبقى المعلومات التي أنت بحاجة لمعرفتها متوفرة بشكل دائم.</li>
		</ul><br/>
		<a class="aboutHeader" name="windowsupdates">تحديثات لـ Microsoft Windows</a><br /><br/>
		تتضمن تحديثات Microsoft Windows الموجودة على الموقع إصلاحات وتحديثات وتحسينات لأنظمة تشغيل Windows التالية:<br /><br />
		Microsoft Windows 98<br />
		Microsoft Windows 98 Second Edition<br />
		Microsoft Windows 2000 Professional<br />
		Microsoft Windows 2000 Server<br />
		Microsoft Windows 2000 Advanced Server<br />
		Microsoft Windows Millennium Edition (Windows Me)<br />
		Microsoft Windows XP<br />
		Microsoft Windows Server 2003<br />
		الإصدارات ذات 64 بت من مجموعة أنظمة تشغيل Microsoft Windows Server 2003<br /><br />
		فئات التحديثات لنظام تشغيل Windows هي:<br />
		<ul type="disc">
			<li><b>التحديثات الضرورية</b> – إصلاحات أمنية وتحديثات هامة أخرى لبقاء جهازك في أحدث حالة وتأكيد أمان شبكة الاتصال.</li>
			<li><b>التحميلات المستحسنة</b> – أحدث الحزم الخدمية لـ Windows و Internet Explorer وتحديثات أخرى هامة.</li>
			<li><b>أدوات Windows</b> – أدوات تتوفر لتحسين الأداء وتسهيل عمليات الترقية والتخفيف من مهام مسؤولي النظام.</li>
			<li><b>تحديثات Internet وتعدد الوسائط</b> – أحدث إصدارات Internet Explorer وترقيات لـ Windows Media&trade; Player والمزيد. </li>
			<li><b>تحميلات إضافية لـ Windows</b> – تحديثات لإعدادات سطح المكتب لديك وميزات أخرى لـ Windows.</li>
			<li><b>ميزات تعدد اللغات</b> – دعم اللغات للقوائم ومربعات الحوار ومحرر وسائط الإدخال للعديد من اللغات.</li>
		</ul>
		يوجد أيضاً دلائل للنشر ووثائق أخرى تتعلق ببرامج الكمبيوتر.<br /><br/>
		<a class="aboutHeader" name="driverupdates">تحديثات لبرامج تشغيل الأجهزة</a><br /><br/>
		توفر نشرة Windows Update المصورة مجموعة شاملة من برامج تشغيل الأجهزة التي تحمل شعار <a href="http://go.microsoft.com/fwlink/?linkid=9577&clcid=0x401" target ="_blank" class="sys-link-normal">Designed for Windows</a>. إن الغرض من مختبر جودة الأجهزة لنظام التشغيل Microsoft Windows هو التأكد من توافق الأجهزة مع أنظمة تشغيل Microsoft. يوفر هذا المختبر مجموعات أدوات اختبارية تستخدم في تأهيل الأجهزة والأنظمة والملقمات لعرض شعار Designed for Windows ولتضمينها في <a href="http://go.microsoft.com/fwlink/?linkid=9492&clcid=0x401" target="_blank" class="sys-link-normal">نشرة Windows المصورة</a>.<br />
		تحتوي نشرة برامج تشغيل الأجهزة على الآلاف من برامج تشغيل الأجهزة المحدثة لآلاف الأجهزة. وقد تم اختبار تحديثات برامج التشغيل هذه من قِبل Microsoft للتأكد من جودتها ومن توافقها مع أنظمة تشغيل Windows والمكونات المتعلقة بها.<br /><br />
		<span class="aboutHeader">تركيب الحزمة</span><br /><br/>
		أثناء عملية التحميل، سيتم مطالبتك باختيار الموقع حيث تريد حفظ الملفات التي تم تحميلها. قم بإدخال مسار مجلد مسبق الوجود باستخدام اصطلاح التسمية العالمي (UNC)، أو انقر فوق زر الاستعراض على صفحة قائمة التحميل لتحديد موقع. سيتم استخدام مسار UNC كالدليل الجذر. من الممكن أن يكون مسار الدليل على جهازك المحلي أو على جهاز على شبكة الاتصال. يتم إنشاء دلائل فرعية لكل مكون يتم تحميله.<br /><br />
		على سبيل المثال: إذا قمت بإنشاء دليل يدعى <b>C:\Updates</b><br /><br />
		إن تحميل مكون برنامج محدد يقوم بإنشاء دليل فرعي<br /><b> \[Software]\[Locale]\[Platform]\[PackageName].[PackageVersion]</b><br /><br />
		إن تحميل برامج تشغيل يقوم بإنشاء دليل فرعي<br /><b> \[Driver]\[Locale]\[Platform]\[PackageName].[PackageVersion]</b><br /><br />
		استخدم صفحة محفوظات التحميل للتأكد من نجاح التحميل ومن موقع ملف مكون محدد.<br /><br />
		<br />

		<a class="aboutHeader">الأسئلة المتداولة</a><br />
		<ol>
			<li>
				<b>ما هو Windows Update?</b><br />
				إن Windows Update هو ملحق نظام التشغيل Windows عبر إنترنت الذي يساعدك على الحفاظ على بقاء جهازك في أحدث حالة. استخدم Windows Update لاختيار التحديثات الخاصة بنظام التشغيل والبرامج والأجهزة الموجودة على الكمبيوتر الخاص بك. يتم إضافة محتوى جديد للموقع بانتظام حتى يمكنك الحصول دومًا على أحدث التحديثات والتصحيحات لحماية الكمبيوتر الخاص بك واستمرارية عمله دون مشاكل.<br />
			</li>
			<!-- <li>
				<b>لماذا تظهر رسالة تفيد بعدم أمان وجود عنصر تحكم ActiveX على هذه الصفحة؟</b><br />
				تظهر هذه الرسالة عندما يكون قد تم تعيين إعدادات الأمان لـ Internet Explorer على المستوى العالي. لكي يعمل Windows Update بشكل صحيح، يجب تغيير إعدادات الأمان لمنطقة إنترنت إلى المستوى المتوسط أو أقل. للقيام بهذا، انتقل إلى Internet Explorer وانقر فوق القائمة <b>أدوات</b> وثم انقر فوق <b>خيارات إنترنت</b>. انقر فوق علامة التبويب <b>أمان</b> ومن ثم انقر فوق <b>إنترنت</b>.  لتعديل مستوى الأمان, انقر فوق <b>مستوى افتراضي</b> أو <b>مستوى مخصص</b>.<br />
			</li> -->
			<li>
				<b>‏‏ما هو عنصر التحكم ActiveX؟</b><br />
				‏‏إن عناصر تحكم ActiveX هي مكونات برامج قابلة لإعادة الاستعمال والتي تتضمن تكنولوجيا ActiveX.  من الممكن استخدام هذه المكونات لإضافة الوظائف المخصصة كالحركة والقوائم المنبثقة لصفحات ويب وبرامج الكمبيوتر وأدوات تطوير البرامج. يستخدم Windows Update عناصر تحكم ActiveX لتحديد البرامج التي تم تثبيتها على جهازك لتوفير قائمة صحيحة بالتحديثات والبرامج الأخرى التي قد تحتاج إلى تحميلها.<br />
			</li>
			<li>
				<b>‏‏ما هو إعداد الدقة الأفضل لعرض موقع Windows Update؟</b><br />
				تم تصميم صفحات ويب على موقع Windows Update ليتم عرضها على شاشة ذو دقة 800 بـ 600 أو أعلى. لتعيين مستوى الدقة هذا، انقر فوق الزر <b>ابدأ</b> ثم انقر فوق <b>لوحة التحكم</b>. انقر فوق رمز <b>المظهر والسمات</b> ومن ثم انقر فوق <b>تغيير دقة الشاشة</b>.<br />
			</li>
		</ol>
	</body>
</html>

