
<html dir="ltr">
	<head>
		<meta http-equiv="PICS-Label" content='(PICS-1.1 "http://www.rsac.org/ratingsv01.html" l gen true comment "RSACi North America Server" by "inet@microsoft.com" on "1997.06.30T14:48-0500" r (n 0 s 0 v 0 l 0))' />
		<meta http-equiv="Content-Type" content="text/html;charset=windows-1253" />
		<meta http-equiv="MSThemeCompatible" content="yes" />
		<meta name="MSSmartTagsPreventParsing" content="yes" />
		<script language="JScript" type="text/javascript">function window.onerror(sMessage, sURL, sLine){ return true; }</script><script language="JScript" type="text/javascript" src="/shared/js/content.js"></script><link rel="stylesheet" type="text/css" href="/shared/css/hcp.css" />
		<link rel="stylesheet" type="text/css" href="/shared/css/content.css" />
		
		<title>Πλαίσιο περιεχομένων</title>
	</head>
	<body onload="fnInit(5, -1);">
		<span class="sys-font-heading3 sys-rhp-color-title">Πληροφορίες σχετικά με το Windows Update</span><br />
		Το Windows Update είναι η ηλεκτρονική επέκταση των Windows, η οποία σας βοηθά να διατηρείτε ενημερωμένο τον υπολογιστή σας. Χρησιμοποιήστε το Windows Update για να επιλέξετε ενημερωμένες εκδόσεις για το λειτουργικό σύστημα, το λογισμικό και το υλικό του υπολογιστή σας. Νέο περιεχόμενο προστίθεται τακτικά στην τοποθεσία, ώστε να μπορείτε πάντα να αποκτήσετε τις πιο πρόσφατες ενημερωμένες εκδόσεις και ενημερώσεις κώδικα, οι οποίες προστατεύουν τον υπολογιστή σας και διασφαλίζουν την ομαλή λειτουργία του. <br /><br />
		<ol>
			 <li>Αναζητάτε τις πιο πρόσφατες ενημερωμένες εκδόσεις για τον προσωπικό σας υπολογιστή; Κάνοντας κλικ στην επιλογή "Windows Update" στο μενού "Έναρξη" ή στην κεντρική σελίδα του Κέντρου βοήθειας και υποστήριξης, το Windows Update διευκολύνει την αναζήτηση και σας προσφέρει μόνο τις ενημερωμένες εκδόσεις που ανταποκρίνονται αποκλειστικά στις ανάγκες του υπολογιστή σας.<a href="#windowsupdate" class="sys-link-normal">Περισσότερες πληροφορίες για το Windows Update.</a></li>
			 <li>Εάν είστε διαχειριστής δικτύου ή έμπειρος χρήστης και πρέπει να κάνετε λήψη ενημερωμένων εκδόσεων για άλλους υπολογιστές, επωφεληθείτε από τον κατάλογο του Windows Update. Κάντε απλώς κλικ στην επιλογή "Κατάλογος του Windows Update" στο αριστερό παράθυρο περιήγησης (εάν δεν εμφανίζεται, κάντε κλικ στην επιλογή </b> Προσαρμογή του Windows Update</b>, για να δείτε τις επιλογές εμφάνισης αυτής της σύνδεσης).  <a href="#windowscatalog" class="sys-link-normal">Περισσότερες πληροφορίες για τον κατάλογο του Windows Update.</a></li>
		</ol>
		<br />

		<a name="windowsupdate" class="aboutHeader">Windows Update</a><br />
		<ul type="square">
			<li>
				<b>Πώς θα ξέρω εάν χρειάζομαι μια ενημερωμένη έκδοση;</b><br />
				Το Windows Update ελέγχει τον υπολογιστή σας και σας παρέχει μια προσαρμοσμένη επιλογή ενημερωμένων εκδόσεων που ισχύουν μόνο για τα στοιχεία του υπολογιστή σας. Κατά τον έλεγχο αυτόν, εμφανίζεται μια λίστα κατηγοριών στην ενότητα  "Καλώς ορίσατε στο Windows Update" και ο αριθμός των ενημερωμένων εκδόσεων που είναι διαθέσιμες σε κάθε κατηγορία σημειώνεται σε παρενθέσεις.<br /><br />
			</li>
			<li>
				<b>Οι κρίσιμες ενημερωμένες εκδόσεις είναι πολύ σημαντικές.</b><br />
				Κάθε ενημερωμένη έκδοση που είναι κρίσιμη για τη λειτουργία του υπολογιστή σας θεωρείται "Κρίσιμη ενημερωμένη έκδοση" και επιλέγεται αυτόματα για εγκατάσταση κατά την αναζήτηση των διαθέσιμων ενημερωμένων εκδόσεων. Αυτές οι ενημερωμένες εκδόσεις παρέχονται για να σας βοηθήσουν να επιλύσετε γνωστά θέματα και να προστατεύσετε τον υπολογιστή σας από γνωστά θέματα ευπάθειας ασφαλείας. Εάν μια κρίσιμη ενημερωμένη έκδοση ισχύει για το λειτουργικό σύστημα, τα προγράμματα λογισμικού ή το υλικό σας, παρατίθεται στην κατηγορία &quot;Κρίσιμες ενημερωμένες εκδόσεις&quot;.<br /><br />
			</li>
			<li>
				<b>Πώς λειτουργεί;</b><br />
				Ακολουθήστε μια απλή διαδικασία τριών βημάτων, για να κάνετε λήψη των ενημερωμένων εκδόσεων που χρειάζεστε για να διατηρήσετε τον υπολογιστή σας ενημερωμένο:<br />
				<ol>
					<li>Κατά την είσοδό σας στο Windows Update, κάντε κλικ στην επιλογή <b>Σάρωση για ενημερωμένες εκδόσεις</b>.</li>
					<li>Κατά την περιήγησή σας στις ενημερωμένες εκδόσεις που είναι διαθέσιμες σε κάθε κατηγορία,  κάντε κλικ στην επιλογή <b>Προσθήκη</b>, για να επιλέξετε την ενημερωμένη έκδοση που θέλετε και να την προσθέσετε στη συλλογή ενημερωμένων εκδόσεων που θέλετε να εγκαταστήσετε. Μπορείτε επίσης να διαβάσετε μια πλήρη περιγραφή κάθε στοιχείου, κάνοντας κλικ στη σύνδεση <b>Περισσότερες πληροφορίες</b>.</li>
					<li>Όταν επιλέξετε όλες τις ενημερωμένες εκδόσεις που θέλετε, κάντε κλικ στην επιλογή <b>Ανασκόπηση και εγκατάσταση των ενημερωμένων εκδόσεων</b> και στη συνέχεια κάντε κλικ στο κουμπί <b>Άμεση εγκατάσταση</b>.</li>
				</ol>
				<b><b>Σημείωση</b></b> Ορισμένες ενημερωμένες εκδόσεις ίσως απαιτήσουν επανεκκίνηση του υπολογιστή σας. Πριν ξεκινήσετε τη διαδικασία εγκατάστασης, αποθηκεύστε την εργασία σας και κλείστε όλα τα ανοικτά προγράμματα.<br /><br />
			</li>
			<li>
				<b>Έχετε απορίες σχετικά με μια ενημερωμένη έκδοση;</b><br />
				Κάθε ενημερωμένη έκδοση συνοδεύεται από μια σύντομη περιγραφή και μια σύνδεση <b>Περισσότερες πληροφορίες</b>. Κάντε κλικ στη σύνδεση <b>Περισσότερες πληροφορίες</b> οποιαδήποτε στιγμή, για να προβάλετε πληροφορίες για κάθε επιμέρους ενημερωμένη έκδοση. Αυτές οι πληροφορίες περιλαμβάνουν τις απαιτήσεις συστήματος και, εάν υπάρχουν, οδηγίες σχετικά με τον τρόπο χρήσης και κατάργησης της εγκατάστασης της ενημερωμένης έκδοσης.<br /><br />
			</li>
			<li>Για να δείτε τη λίστα με τις ενημερωμένες εκδόσεις που έχετε εγκαταστήσει από το Windows Update, κάντε κλικ στην επιλογή <b>Προβολή ιστορικού εγκατάστασης</b>.<br /><br /></li>
			<li>Για λεπτομέρειες σχετικά με την υποστήριξη της τοποθεσίας  Windows Update και την υποστήριξη για τις ενημερωμένες εκδόσεις που έχετε εγκαταστήσει από το Windows Update, επισκεφτείτε τη σελίδα <a href="support.asp" class="sys-link-normal">Πληροφορίες υποστήριξης</a>.<br /><br /></li>
		</ul>
		<br />

		<a name="privacypolicy" class="aboutHeader">Δήλωση προστασίας ιδιωτικού απορρήτου του Windows Update (τελευταία ενημέρωση 17/10/2003)</a><br />
		Το Windows Update δεσμεύεται για την προστασία του ιδιωτικού σας απορρήτου. Για να σας παρέχει την κατάλληλη λίστα ενημερωμένων εκδόσεων, το Windows Update πρέπει να συλλέξει ένα ορισμένο ποσό πληροφοριών για τις ρυθμίσεις του υπολογιστή σας. Καμία από αυτές τις πληροφορίες δεν μπορεί να χρησιμοποιηθεί για την αναγνώρισή σας. Αυτές οι πληροφορίες περιλαμβάνουν τις εξής:<br />
		<ul type="square">
			<li>Αριθμός έκδοσης του λειτουργικού συστήματος</li>
			<li>Αριθμός έκδοσης του Internet Explorer</li>
			<li>Αριθμοί έκδοσης άλλου λογισμικού για το οποίο το Windows Update παρέχει ενημερωμένες εκδόσεις</li>
			<li>Αριθμοί αναγνωριστικού  Τοποθέτησης και Άμεσης Λειτουργίας των συσκευών υλικού</li>
			<li>Ρύθμιση περιοχής και γλώσσας</li>
		</ul>
		Οι πληροφορίες διαμόρφωσης που συλλέγονται χρησιμοποιούνται μόνο για να προσδιοριστούν οι κατάλληλες ενημερωμένες εκδόσεις και για τη δημιουργία συγκεντρωτικών στατιστικών στοιχείων. Το Windows Update δεν συλλέγει το όνομα, τη διεύθυνση, τη διεύθυνση ηλεκτρονικού ταχυδρομείου σας ή οποιαδήποτε άλλη μορφή προσωπικά αναγνωρίσιμων πληροφοριών.<br /><br />
		Το Windows Update συλλέγει, επίσης, τον αναγνωριστικό αριθμό προϊόντος και τον αριθμό-κλειδί προϊόντος, για να επιβεβαιωθεί ότι χρησιμοποιείτε νόμιμο αντίτυπο των Windows. Το νόμιμο αντίτυπο των Windows διασφαλίζει ότι θα λαμβάνετε διαρκώς ενημερωμένες εκδόσεις από το Windows Update. Ο αναγνωριστικός αριθμός προϊόντων, καθώς και ο αριθμός-κλειδί προϊόντος δεν διατηρούνται μετά τον τερματισμό της περιόδου λειτουργίας του Windows Update, εκτός εάν ο αναγνωριστικός αριθμός προϊόντος δεν είναι έγκυρος.<br /><br />
		Για να προσφέρει τις καλύτερες δυνατές υπηρεσίες, το Windows Update παρακολουθεί και καταγράφει επίσης πόσοι μεμονωμένοι υπολογιστές επισκέπτονται την τοποθεσία και εάν η λήψη και εγκατάσταση συγκεκριμένων ενημερωμένων εκδόσεων έγινε με επιτυχία ή απέτυχε. Για αυτόν το σκοπό, τα Windows δημιουργούν ένα καθολικά μοναδικό αναγνωριστικό (GUID), το οποίο αποθηκεύεται στον υπολογιστή σας για την αποκλειστική αναγνώρισή του. Το GUID δεν περιλαμβάνει προσωπικές πληροφορίες αναγνώρισης και δεν μπορεί να χρησιμοποιηθεί για την αναγνώρισή σας. Το Windows Update καταγράφει το GUID του υπολογιστή, από τον οποίο προσπαθήσατε να κάνετε λήψη και εγκατάσταση του στοιχείου, καθώς και τις παραπάνω πληροφορίες διαμόρφωσης.<br /><br /><br />
		<a class="aboutHeader" name="windowscatalog">Κατάλογος του Windows Update</a><br />
		Ο κατάλογος του Windows Update παρέχει μια πλήρη λίστα των ενημερωμένων εκδόσεων που μπορούν να διανεμηθούν μέσω ενός εταιρικού δικτύου. Πρόκειται για μία και μόνο θέση για ενημερωμένες εκδόσεις των Windows, ενημερώσεις κώδικα και βελτιώσεις, καθώς και <a href="#driverupdates" class="sys-link-normal">προγράμματα οδήγησης συσκευών</a> με το λογότυπο <a href="http://go.microsoft.com/fwlink/?linkid=9577&clcid=0x408" target ="_blank" class="sys-link-normal">Designed for Windows</a>.<br /><br />
		Για να αποκτήσετε ενημερωμένες εκδόσεις από τον κατάλογο του Windows Update, ακολουθήστε αυτήν τη διαδικασία τριών βημάτων:<br /><br />
		<ol>
			<li>Ξεκινήστε με την επιλογή μιας κατηγορίας:
				<ul type="disc">
					<li>Η κατηγορία <a href="#windowsupdates" class="sys-link-normal">Microsoft Windows</a> διαθέτει ενημερωμένες εκδόσεις και ενημερώσεις κώδικα για όλα τα λειτουργικά συστήματα των Windows, από τα Windows 98 έως τα Windows XP και την οικογένεια διακομιστών Windows Server 2003.</li>
					<li>Η κατηγορία <a href="#driverupdates" class="sys-link-normal">Προγράμματα οδήγησης υλικού</a> σάς παρέχει ενημερωμένες εκδόσεις προγραμμάτων οδήγησης για πολλές από τις συσκευές του δικτύου σας.</li>
				</ul>
			</li>
			<li>Ρυθμίστε τα κριτήρια αναζήτησής σας, για να εντοπίσετε τις ενημερωμένες εκδόσεις που χρειάζεστε.</li>
			<li>Κάντε λήψη των ενημερωμένων εκδόσεων που έχετε επιλέξει στη θέση που θέλετε. Αυτή μπορεί να είναι ο τοπικός σκληρός δίσκος σας, ένα κοινόχρηστο στοιχείο διακομιστή στο δίκτυό σας ή μια δισκέτα.</li>
		</ol>

		Πρόσθετες δυνατότητες της τοποθεσίας περιλαμβάνουν:<br /><br />
		<ul type="disc">
			<li>Προ-συσκευασία των ενημερωμένων εκδόσεων σε δομή υποκαταλόγου με βάση: τον τύπο ενημερωμένης έκδοσης (λογισμικό ή πρόγραμμα οδήγησης), την τοποθεσία και το όνομα στοιχείου.<br/>(π.χ., \Λογισμικό\[Τοποθεσία]\[Πλατφόρμα]\[Όνομαστοιχείου])</li>
			<li>Η προβολή του ιστορικού λήψης εμφανίζει τις ενημερωμένες εκδόσεις των οποίων έχει γίνει λήψη και τη θέση τους.</li>
			<li>Σύντομες περιγραφές και αρχεία &quot;Περισσότερες πληροφορίες...&quot; για κάθε στοιχείο. Συνδέσεις σε σχετικές τοποθεσίες Web εμφανίζονται σε αυτά τα αρχεία και η λήψη τους γίνεται στον ίδιο υποκατάλογο με την ενημερωμένη έκδοση λογισμικού, ώστε να είναι πάντα διαθέσιμες οι σημαντικές πληροφορίες που πρέπει να γνωρίζετε.</li>
		</ul><br/>
		<a class="aboutHeader" name="windowsupdates">Ενημερωμένες εκδόσεις για τα Microsoft Windows</a><br /><br/>
		Οι ενημερωμένες εκδόσεις των Microsoft Windows που βρίσκονται στην τοποθεσία περιλαμβάνουν ενημερώσεις κώδικα, ενημερωμένες εκδόσεις και βελτιώσεις στα ακόλουθα λειτουργικά συστήματα Windows:<br /><br />
		Microsoft Windows 98<br />
		Microsoft Windows 98 Δεύτερη Έκδοση<br />
		Microsoft Windows 2000 Professional<br />
		Microsoft Windows 2000 Server<br />
		Microsoft Windows 2000 Advanced Server<br />
		Microsoft Windows Millennium Edition (Windows Me)<br />
		Microsoft Windows XP<br />
		Microsoft Windows Server 2003<br />
		οι εκδόσεις 64-bit της οικογένειας προϊόντων Microsoft Windows Server 2003<br /><br />
		Οι κατηγορίες για τις ενημερωμένες εκδόσεις των λειτουργικών συστημάτων των  Windows είναι οι εξής:<br />
		<ul type="disc">
			<li><b>Κρίσιμες ενημερωμένες εκδόσεις</b> – ενημερώσεις κώδικα ασφαλείας και άλλες σημαντικές ενημερωμένες εκδόσεις για να διατηρείτε τους υπολογιστές σας ενημερωμένους και το δίκτυό σας ασφαλές.</li>
			<li><b>Προτεινόμενες λήψεις</b> – τα νεότερα service pack των Windows και του Internet Explorer  και άλλες σημαντικές ενημερωμένες εκδόσεις.</li>
			<li><b>Εργαλεία των Windows</b> – βοηθητικά προγράμματα και άλλα εργαλεία που παρέχονται για τη βελτίωση των επιδόσεων, τη διευκόλυνση των αναβαθμίσεων και τη μείωση του φόρτου εργασίας των διαχειριστών συστημάτων.</li>
			<li><b>Ενημερωμένες εκδόσεις για Internet και πολυμέσα</b> – οι πιο πρόσφατες εκδόσεις του Internet Explorer, αναβαθμίσεις του Windows Media&trade; Player και άλλα. </li>
			<li><b>Πρόσθετες λήψεις των Windows</b> – ενημερωμένες εκδόσεις για τις ρυθμίσεις της επιφάνειας εργασίας σας και άλλες δυνατότητες των Windows.</li>
			<li><b>Πολύγλωσσα χαρακτηριστικά</b> – μενού και παράθυρα διαλόγου, υποστήριξη γλώσσας και Input Method Editor για διάφορες γλώσσες.</li>
		</ul>
		Επίσης, υπάρχουν οδηγοί ανάπτυξης και άλλα έγγραφα που σχετίζονται με το λογισμικό.<br /><br/>
		<a class="aboutHeader" name="driverupdates">Ενημερωμένες εκδόσεις για προγράμματα οδήγησης υλικού</a><br /><br/>
		Ο κατάλογος του Windows Update προσφέρει μια πλήρη συλλογή προγραμμάτων οδήγησης συσκευών με το λογότυπο <a href="http://go.microsoft.com/fwlink/?linkid=9577&clcid=0x408" target ="_blank" class="sys-link-normal">Designed for Windows</a>. Ο σκοπός των εργαστηρίων ποιότητας υλικού των Windows της Microsoft είναι να διασφαλίσει τη συμβατότητα του υλικού με τα λειτουργικά συστήματα της Microsoft. Τα WHQL παρέχουν κιτ ελέγχου τα οποία χρησιμοποιούνται για την πιστοποίηση συσκευών, συστημάτων και διακομιστών που εμφανίζουν το λογότυπο Designed for Windows και για να συμπεριληφθούν αυτά στον <a href="http://go.microsoft.com/fwlink/?linkid=9492&clcid=0x408" target="_blank" class="sys-link-normal">Κατάλογο Windows</a>.<br />
		Ο κατάλογος των προγραμμάτων οδήγησης υλικού διαθέτει χιλιάδες ενημερωμένες εκδόσεις προγραμμάτων οδήγησης συσκευών για χιλιάδες συσκευές. Αυτές οι ενημερωμένες εκδόσεις προγραμμάτων οδήγησης έχουν υποβληθεί σε εκτεταμένους ελέγχους από τη Microsoft, για να διασφαλιστεί η ποιότητα και η συμβατότητά τους με τα λειτουργικά συστήματα των Windows και τα σχετικά στοιχεία.<br /><br />
		<span class="aboutHeader">Κωδικοποίηση συσκευασίας</span><br /><br/>
		Κατά τη διάρκεια της διαδικασίας λήψης, θα σας ζητηθεί να επιλέξετε τη θέση όπου θέλετε να αποθηκεύσετε τα αρχεία των οποίων έγινε λήψη. Πληκτρολογήστε μια διαδρομή UNC (Universal Naming Convention - Διεθνής Σύμβαση Ονομάτων) σε ένα φάκελο που ήδη υπάρχει ή κάντε κλικ στο κουμπί "Αναζήτηση" στη σελίδα "Λίστα λήψεων", για να επιλέξετε μια θέση. Αυτή η διαδρομή UNC θα χρησιμοποιηθεί ως ο ριζικός κατάλογος. Μπορεί να είναι μια διαδρομή καταλόγου στον τοπικό υπολογιστή σας ή σε έναν υπολογιστή στο δίκτυό σας.  Για κάθε στοιχείο του οποίου γίνεται λήψη δημιουργούνται υποκατάλογοι.<br /><br />
		Για παράδειγμα: Εάν δημιουργήσετε έναν κατάλογο που ονομάζεται <b>C:\Updates</b><br /><br />
		Η λήψη ενός επιλεγμένου στοιχείου λογισμικού δημιουργεί έναν υποκατάλογο<br /><b> \[Λογισμικό]\[Τοποθεσία]\[Πλατφόρμα]\[Όνομα πακέτου].[Έκδοση πακέτου]</b><br /><br />
		Η λήψη προγραμμάτων οδήγησης δημιουργεί έναν υποκατάλογο<br /><b> \[Προγράμμαοδήγησης]\[Τοποθεσία]\[Πλατφόρμα]\[Όνομα πακέτου].[Έκδοση πακέτου]</b><br /><br />
		Χρησιμοποιήστε τη σελίδα "Iστορικό λήψης", για να επιβεβαιώσετε την επιτυχία της λήψης και τη θέση ενός συγκεκριμένου αρχείου στοιχείων.<br /><br />
		<br />

		<a class="aboutHeader">Συνήθεις ερωτήσεις</a><br />
		<ol>
			<li>
				<b>Τι είναι το Windows Update;</b><br />
				Το Windows Update είναι η ηλεκτρονική επέκταση των Windows, η οποία σας βοηθά να διατηρείτε ενημερωμένο τον υπολογιστή σας. Χρησιμοποιήστε το Windows Update για να επιλέξετε ενημερωμένες εκδόσεις για το λειτουργικό σύστημα, το λογισμικό και το υλικό του υπολογιστή σας. Νέο περιεχόμενο προστίθεται τακτικά στην τοποθεσία, ώστε να μπορείτε πάντα να αποκτήσετε τις πιο πρόσφατες ενημερωμένες εκδόσεις και ενημερώσεις κώδικα, οι οποίες προστατεύουν τον υπολογιστή σας και διασφαλίζουν την ομαλή λειτουργία του.<br />
			</li>
			<!-- <li>
				<b>Γιατί λαμβάνω ένα μήνυμα ότι ένα στοιχείο ελέγχου ActiveX σε αυτήν τη σελίδα δεν είναι ασφαλές;</b><br />
				Αυτό το μήνυμα εμφανίζεται, όταν έχει οριστεί η επιλογή "Υψηλό" στη ρύθμιση επιπέδου ασφαλείας του Internet Explorer. Για να λειτουργεί σωστά η τοποθεσία του Windows Update, πρέπει να αλλάξετε τις ρυθμίσεις επιπέδου ασφαλείας για τη ζώνη Internet, χρησιμοποιώντας την επιλογή "Μεσαίο" ή "Χαμηλό". Για να γίνει αυτό, μεταβείτε στον Internet Explorer, κάντε κλικ στο μενού <b>Εργαλεία</b> και στη συνέχεια κάντε κλικ στην εντολή <b>Επιλογές Internet</b>. Κάντε κλικ στην καρτέλα <b>Ασφάλεια</b> και κατόπιν κάντε κλικ στo εικονίδιο <b>Internet</b>. Για να προσαρμόσετε το επίπεδο ασφαλείας σας, κάντε κλικ στην επιλογή <b>Προεπιλεγμένο επίπεδο</b> ή στην επιλογή <b>Προσαρμοσμένο επίπεδο</b>.<br />
			</li> -->
			<li>
				<b>Τι είναι τα στοιχεία ελέγχου ActiveX;</b><br />
				Τα στοιχεία ελέγχου ActiveX είναι στοιχεία λογισμικού πολλών χρήσεων που ενσωματώνουν τεχνολογία ActiveX. Αυτά τα στοιχεία μπορούν να χρησιμοποιηθούν για την προσθήκη ειδικών λειτουργιών, όπως κίνησης ή αναδυόμενων μενού, σε ιστοσελίδες, προγράμματα και εργαλεία ανάπτυξης λογισμικού. Το Windows Update χρησιμοποιεί στοιχεία ελέγχου ActiveX για να ελέγξει τι είδους λογισμικό είναι εγκατεστημένο στον υπολογιστή σας, ώστε να σας παράσχει μια σωστή λίστα με ενημερωμένες εκδόσεις και άλλο λογισμικό, των οποίων ίσως θέλετε να κάνετε λήψη.<br />
			</li>
			<li>
				<b>Ποια είναι η καλύτερη ανάλυση για την προβολή της τοποθεσίας Windows Update;</b><br />
				Οι ιστοσελίδες στην τοποθεσία του Windows Update έχουν σχεδιαστεί για προβολή σε ανάλυση οθόνης 800 επί 600 ή υψηλότερη. Για να ορίσετε αυτήν την ανάλυση, κάντε κλικ στο κουμπί <b>Έναρξη</b> και κατόπιν κάντε κλικ στην επιλογή <b>Πίνακας Ελέγχου</b>. Κάντε κλικ στο εικονίδιο <b>Εμφάνιση και θέματα</b> και στη συνέχεια κάντε κλικ στην επιλογή <b>Αλλαγή της ανάλυσης οθόνης</b>.<br />
			</li>
		</ol>
	</body>
</html>

